tap "ebc-2in2crc/zlibcmd"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"
tap "xecua/repo"

brew "bat"
brew "binutils"
brew "coreutils"
brew "cpanminus"
brew "curl"
brew "direnv"
brew "docutils"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "firebase-cli"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gradle"
brew "haskell-stack"
brew "hexyl"
brew "htop"
brew "insect"
brew "iproute2mac"
brew "jid"
brew "jq"
brew "kotlin"
brew "llvm"
brew "mas"
brew "neofetch"
brew "neovim"
brew "nkf"
brew "nmap"
brew "opam"
brew "openjdk@8"
brew "pandoc"
brew "pastel"
brew "peco"
brew "perl"
brew "poetry"
brew "pympress"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "sccache"
brew "starship"
brew "thefuck"
brew "tig"
brew "universal-ctags", args: ["HEAD"]
brew "wget"
brew "yapf"
brew "yarn"
brew "zlibcmd"
brew "zstd"
brew "eth-p/software/bat-extras"

cask "aquaskk"
cask "clipy"
cask "cloudflare-warp"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "f5vpn"
cask "figma"
cask "firefox-developer-edition"
cask "flutter"
cask "font-3270"
cask "font-cica"
cask "font-cinecaption"
cask "font-ipaexfont"
cask "font-kin-iro-sans-serif"
cask "font-koharuiro-sunray"
cask "font-komorebi-gothic"
cask "font-last-resort"
cask "font-mplus"
cask "font-myrica"
cask "font-myricam"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-rolachan"
cask "font-source-han-code-jp"
cask "font-source-han-sans"
cask "google-backup-and-sync"
cask "gpg-suite"
cask "hetimazip-qlgenerator"
cask "iterm2"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "onyx"
cask "qbittorrent"
cask "qlmarkdown"
cask "qlstephen"
cask "skim"
cask "spotify"
cask "termhere"
cask "thunderbird"
cask "visual-studio-code"
cask "vivaldi"
cask "xquartz"
cask "zotero"

mas "BetterTDeck for TweetDeck", id: 1549421502
mas "Bitwarden", id: 1352778147
mas "GhostText", id: 1552641506
mas "LINE", id: 539883307
mas "Slack", id: 803453959
mas "Twitter", id: 1482454543
mas "Userscripts", id: 1463298887
mas "Vimari", id: 1480933944
mas "WakeOnCommand", id: 1484204619
